# Import all the required Python Libraries.

In [2]:
import pandas as pd

# Load the Dataset into pandas dataframe.

In [3]:
df=pd.read_csv("study_performance.csv")

In [4]:
df.head()

,gender,race_ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score
0,female,group B,bachelor's degree,NaN,none,NaN,72.0,74
1,female,group C,some college,standard,completed,69.0,90.0,88
2,female,group B,master's degree,standard,none,90.0,NaN,93
3,male,group A,associate's degree,free/reduced,none,47.0,57.0,44
4,male,group C,some college,standard,none,76.0,78.0,75

# Data Preprocessing: check for missing values in the data using pandas isnull(), describe() function to get some initial statistics.

In [5]:
df.isnull().sum()

gender                         0
race_ethnicity                 0
parental_level_of_education    0
lunch                          1
test_preparation_course        0
math_score                     1
reading_score                  1
writing_score                  0
dtype: int64

In [6]:
df.dropna(axis=0, inplace=True)

In [10]:
df.isnull().sum()

gender                         0
race_ethnicity                 0
parental_level_of_education    0
lunch                          0
test_preparation_course        0
math_score                     0
reading_score                  0
writing_score                  0
dtype: int64

# Provide variable descriptions. Types of variables etc. Check the dimensions of the data frame.

In [11]:
df.dtypes

gender                          object
race_ethnicity                  object
parental_level_of_education     object
lunch                           object
test_preparation_course         object
math_score                     float64
reading_score                  float64
writing_score                    int64
dtype: object

In [17]:
df.shape

(998, 8)

# Data Formatting and Data Normalization: Summarize the types of variables by checking the data types (i.e., character, numeric, integer, factor, and logical) of the variables in the data set. If variables are not in the correct data type, apply proper type conversions.

In [12]:
df['writing_score']=df['writing_score'].astype(float)

In [13]:
df.dtypes

gender                          object
race_ethnicity                  object
parental_level_of_education     object
lunch                           object
test_preparation_course         object
math_score                     float64
reading_score                  float64
writing_score                  float64
dtype: object

In [14]:
df.head()

,gender,race_ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score
1,female,group C,some college,standard,completed,69.0,90.0,88.0
3,male,group A,associate's degree,free/reduced,none,47.0,57.0,44.0
4,male,group C,some college,standard,none,76.0,78.0,75.0
5,female,group B,associate's degree,standard,none,71.0,83.0,78.0
6,female,group B,some college,standard,completed,88.0,95.0,92.0

# Turn categorical variables into quantitative variables in Python

In [16]:
df['gender']=df['gender'].map({'female':0,'male':1})
df

,gender,race_ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score
1,0,group C,some college,standard,completed,69.0,90.0,88.0
3,1,group A,associate's degree,free/reduced,none,47.0,57.0,44.0
4,1,group C,some college,standard,none,76.0,78.0,75.0
5,0,group B,associate's degree,standard,none,71.0,83.0,78.0
6,0,group B,some college,standard,completed,88.0,95.0,92.0
...,...,...,...,...,...,...,...,...
995,0,group E,master's degree,standard,completed,88.0,99.0,95.0
996,1,group C,high school,free/reduced,none,62.0,55.0,55.0
997,0,group C,high school,free/reduced,completed,59.0,71.0,65.0
998,0,group D,some college,standard,completed,68.0,78.0,77.0
999,0,group D,some college,free/reduced,none,77.0,86.0,86.0